# Pandas Advance-2

In [1]:
# Consider following code to answer further questions:

import pandas as pd

course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']

time_period = [12,8,6,14]

df = pd.DataFrame(data = {'course_name':course_name, 'duration':time_period})

In [2]:
df

        course_name  duration
0      Data Science        12
1  Machine Learning         8
2          Big Data         6
3     Data Engineer        14

Q1. Write a code to print the data present in the second row of the dataframe, df.

In [3]:
df.iloc[1:2,:2]

        course_name  duration
1  Machine Learning         8

Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

In [4]:
df.loc[0:3,['duration']]

   duration
0        12
1         8
2         6
3        14

In [5]:
df.iloc[0:3,:]

        course_name  duration
0      Data Science        12
1  Machine Learning         8
2          Big Data         6

In loc(), we pass the name of the row/column that we want to select from the entire table.

While in iloc(), we have to simply give the index value for respective row and column that we want to select.

Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df 
then find the output for both new_df.loc[2] and new_df.iloc[2].

We will take the previous df for performing reindex....

In [6]:
df

        course_name  duration
0      Data Science        12
1  Machine Learning         8
2          Big Data         6
3     Data Engineer        14

We will re-index the df in order 3,0,1,2 and save it as a new df....

In [8]:
df_new = df.reindex(index=[3,0,1,2])

In [10]:
df_new

        course_name  duration
3     Data Engineer        14
0      Data Science        12
1  Machine Learning         8
2          Big Data         6

In [11]:
df_new.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [12]:
df_new.iloc[2]

course_name    Machine Learning
duration                      8
Name: 1, dtype: object

In first code, we got the output as per the index number that we gave as input...

In second code, we got the output as per the by default index number for the table

In [13]:
import pandas as pd

import numpy as np

columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']

indices = [1,2,3,4,5,6]

#Creating a dataframe:

df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [14]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.066475  0.758995  0.795326  0.768832  0.964859  0.151535
2  0.142829  0.103923  0.680501  0.902699  0.261866  0.001665
3  0.760025  0.577788  0.752758  0.805293  0.798327  0.983030
4  0.505345  0.800476  0.275800  0.687766  0.881631  0.938325
5  0.275602  0.270904  0.831038  0.425218  0.016065  0.459775
6  0.501007  0.248895  0.260749  0.153643  0.651618  0.739209

In [15]:
# Mean of each and every column in the dataframe

In [16]:
df1.describe()

       column_1  column_2  column_3  column_4  column_5  column_6
count  6.000000  6.000000  6.000000  6.000000  6.000000  6.000000
mean   0.375214  0.460163  0.599362  0.623908  0.595728  0.545590
std    0.260800  0.291996  0.261358  0.281543  0.376733  0.410263
min    0.066475  0.103923  0.260749  0.153643  0.016065  0.001665
25%    0.176023  0.254397  0.376975  0.490855  0.359304  0.228595
50%    0.388305  0.424346  0.716630  0.728299  0.724972  0.599492
75%    0.504261  0.713693  0.784684  0.796178  0.860805  0.888546
max    0.760025  0.800476  0.831038  0.902699  0.964859  0.983030

In [19]:
# Standard deviation of column_2
df1['column_2'].std()

0.2919964032722546

Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the 
mean of column, column_2.

In [21]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.066475  0.758995  0.795326  0.768832  0.964859  0.151535
2  0.142829  0.103923  0.680501  0.902699  0.261866  0.001665
3  0.760025  0.577788  0.752758  0.805293  0.798327  0.983030
4  0.505345  0.800476  0.275800  0.687766  0.881631  0.938325
5  0.275602  0.270904  0.831038  0.425218  0.016065  0.459775
6  0.501007  0.248895  0.260749  0.153643  0.651618  0.739209

In [22]:
df1.iloc[1:2,1:2]

   column_2
2  0.103923

In [23]:
df1.iloc[1:2,1:2] = 0.45

In [24]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.066475  0.758995  0.795326  0.768832  0.964859  0.151535
2  0.142829  0.450000  0.680501  0.902699  0.261866  0.001665
3  0.760025  0.577788  0.752758  0.805293  0.798327  0.983030
4  0.505345  0.800476  0.275800  0.687766  0.881631  0.938325
5  0.275602  0.270904  0.831038  0.425218  0.016065  0.459775
6  0.501007  0.248895  0.260749  0.153643  0.651618  0.739209

In [26]:
# Mean of column_2
df1['column_2'].mean()

0.5178429213068215

Q6. What do you understand about the windows function in pandas and list the types of windows 
functions?

Windows function is used to calcute the moving average of the data. There are 3 tyes of windows function:
    
Simple moving average

Cumulative moving average

Exponential weighted moving average

Q7. Write a code to print only the current month and year at the time of answering this question.

In [28]:
from datetime import datetime

current_date = datetime.now()
current_month = current_date.strftime("%B")
current_year = current_date.year

print("Current month and year:", current_month, current_year)

Current month and year: June 2024

Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and 
calculates the difference between them in days, hours, and minutes using Pandas time delta. The 
program should prompt the user to enter the dates and display the result.

In [30]:
def difference(start, end):
    start = pd.to_datetime(start)
    end = pd.to_datetime(end)
    
    time_difference = end - start
    
    days = time_difference.days
    hours = time_difference.seconds // 3600
    minutes = (time_difference.seconds % 3600) // 60
    return days, hours, minutes

start_date_input = input("Enter the start date (YYYY-MM-DD): ")
end_date_input = input("Enter the end date (YYYY-MM-DD): ")

# Calculate the difference between the dates
days_diff, hours_diff, minutes_diff = difference(start_date_input, end_date_input)

# Display the result
print("Difference between the dates:")
print("Days:", days_diff)
print("Hours:", hours_diff)
print("Minutes:", minutes_diff)

Enter the start date (YYYY-MM-DD):  2024-04-11
Enter the end date (YYYY-MM-DD):  2024-07-24

Difference between the dates:
Days: 104
Hours: 0
Minutes: 0

Q11. You are given a CSV file containing student data that includes the student ID and their test score. Write 
a Python program that reads the CSV file, calculates the mean, median, and mode of the test scores, and 
displays the results in a table.

In [ ]:
import pandas as pd

# Prompt user to enter csv file path
file_path = input("Enter the file path of the CSV file containing the student data: ")

# Read CSV file into DataFrame
df = pd.read_csv(file_path)

# Calculate mean, median, and mode of test scores
mean_score = df['Test Score'].mean()
median_score = df['Test Score'].median()
mode_score = df['Test Score'].mode()[0]

# Display the results in a table
results = pd.DataFrame({
    'Statistic': ['Mean', 'Median', 'Mode'],
    'Test Score': [mean_score, median_score, mode_score]
})

print("Results:")
print(results)